<template>
  <div class="space-y-4">
    <h1>کاربر می‌پذیرد که:</h1>
    <ol>
      <li v-for="item in userAccepts">
        {{ item.title }}
        <ul v-if="item.list">
          <li v-for="it in item.list">
            {{ it.title }}
            <ul v-if="it.list">
              <li v-for="i in it.list">{{ i }}</li>
            </ul>
          </li>
        </ul>
      </li>
    </ol>
  </div>
</template>

<script>
export default {
  name: "UserAccepts",
  data() {
    return {
      userAccepts: [
        {
          title:
            "این حق برای سایت تبدیل محفوظ است که در هر زمان که بخواهد، با اعلام مراتب قبلی به کاربر، مفاد این موافقت‌نامه را تغییر دهد.",
        },
        {
          title:
            "تمامی معاملاتِ انجام‌گرفته توسط کاربر، صحیح تلقی می‌گردد. از این رو، صیانت از حساب کاربری، رمز عبور یا سایر اطلاعات، برعهده‌ی کاربر بوده و لازم است به صدمات ناشی از انجام تخلفات یا جرایم مالی توجه داشته‌باشد.",
        },
        {
          title:
            "معاملات ارزهای دیجیتال باید با آگاهی و بررسی انجام شود و مسئولیت ضرر ناآگاهانه از خرید ارزهای دیجیتال،‌ ریسک سرمایه‌گذاری و نوسانات قیمتی، برعهده‌ی خود کاربر است.",
        },
        {
          title:
            "تلاش سایت تبدیل، ارائه‌ی خدمات به‌صورت ۲۴ ساعته در طول شبانه‌روز خواهدبود. لیکن در صورت وقوع حادثه‌ای از قبیل تعلیق خدمات به‌علت اقدام غیرقانونی کاربران یا اشخاص ثالث، یا وقوع خطا در خدمات، مشکل را مرتفع نموده و ارائه‌ی خدمات را از سر می‌گیرد. در این زمان کاربر می‌تواند درخواست بازیابی را بر اساس سوابق معاملاتی ارائه کند؛ اما سایت تبدیل نمی‌تواند سود و زیانِ ناشی از این وقفه‌ی زمانی را جبران کند.",
        },
        {
          title:
            "در صورت وقوع خسارت به سایت در اثر فعالیت‌های غیرقانونی کاربر، سایت می‌تواند طبق قانون نسبت‌به مطالبه‌ی آن اقدام کند. لذا کاربر باید با رعایت قوانین و مقررات از خدمات تبدیل استفاده کند.",
        },
        {
          title:
            "پس از اعلام موارد تغییر در چارچوب موافقت‌نامه و ابلاغ به کاربر، به‌منظور قبول موارد تغییر پس از ۷ روز از تاریخ مؤثر اعمال تغییرات مذکور، و عدم واکنش کاربر، موافقت‌نامه‌ی اصلاحی، از سوی شما، تأییدشده مفروض انگاشته خواهدشد. در صورت عدم توافق کاربر با موافقت‌نامه‌ی اخیر، امکان خروج کاربر از عضویت به‌صورت جداگانه نیز وجود خواهدداشت.",
        },
        {
          title:
            "مواردی که در این موافقت‌نامه نیست، تابع قوانین و مقررات جمهوری اسلامی ایران و یا تابع قواعد اعلامی از سوی تبدیل خواهدبود.",
        },
        {
          title:
            "مالک قانونی وجوه و حساب‌هایی است که وی در هر سفارش، به هر نحو، چه برای پرداخت و چه برای دریافت، از آن‌ها استفاده کرده‌است.",
        },
        {
          title:
            "تراکنش‌هایی که توسط تبدیل در خلال انجام سفارشات، انجام می‌شوند، غیرقابل‌بازگشت هستند و تابع قوانینِ سیستم هر ارز دیجیتال مربوط به تراکنشِ انجام‌شده هستند.",
        },
        {
          title:
            "اطلاعات لازم در طی سفارش را با دقت وارد کرده‌است و کلیه‌ی مسئولیت مربوط به واردکردنِ اشتباهِ اطلاعات در خلال سفارش، با خود کاربر است و تبدیل، هیچ مسئولیتی راجع‌به سفارش انجام‌شده‌ای که اطلاعات اشتباه داشته و موجب زیان کاربر شده، نمی‌پذیرد.",
        },
        {
          title:
            "تبدیل صرفاً مسئول جابه‌جایی مقدار مشخص‌شده در تراکنش (سفارش خرید و فروش) معین است و هیچ‌گونه مسئولیت دیگری ندارد.",
        },
        {
          title:
            "تبدیل هیچ‌گونه مسئولیتی راجع‌به تأخیر یا تراکنش ناموفق ایجادشده در انجام سفارش به‌علت نقص یا مشکل یا تعمیرات سیستم ارز دیجیتال یا بانک پذیرنده ندارد.",
        },
        {
          title:
            "هرگونه پیامدهای مالیاتی ناشی از تراکنش‌های کاربر، برعهده‌ی خود کاربر خواهدبود و تبدیل، هیچ‌گونه مسئولیتی ندارد.",
        },
        {
          title:
            "جز در مورد انجام صحیح سفارش طبق قیمت مشخص و شفاف، و کارمزد مشخص و شفاف طبق قرارداد فوق، هیچ‌گونه ادعایی از سایت تبدیل و مدیران – کارکنان – و کلیه‌ی مرتبطان با این سایت نداشته‌باشد.",
        },
        {
          title:
            "هر آدرس کیف پول رمزارز کاربر، فقط و فقط متعلق به آن رمزارز است و به‌علت شباهت آدرس بعضی رمزارزها با یک‌دیگر، در صورت واریز اشتباه رمزارز دیگری به آدرس مشخص‌شده، تمام مسئولیت واریز اشتباه، برعهده‌ی کاربر است و تبدیل، هیچ مسئولیتی در قبال واریز اشتباه کاربر ندارد.",
        },
        {
          title:
            "آدرس واریز اختصاص‌داده‌شده برای واریز ارز دیجیتال به حساب کاربر، دارای مدت‌زمان محدود است و تمام مسئولیت ارز دیجیتال واریزی پس از انقضای آدرس واریز اختصاص‌یافته به کاربر، برعهده‌ی کاربر خواهدبود.",
        },
        {
          title:
            "تبدیل، برداشت ریالی به حساب کاربر را مطابق سیکل پایا، تا یک روز کاری، در سه بازه‌ی زمانی در ساعات اداری ارسال می‌کند و شماره‌ی پیگیری در تراکنش مربوطه درج می شود. قابل ذکر است مشکلات غیر‌قابل‌پیش‌بینی از قبیل اشکال در شبکه‌ی شاپرک و بانکی در این بازه‌ی زمانی تسویه تاثیرگذار است.",
        },
        {
          title:
            "در صورتی که واریزهای ریالی برای کاربران به‌علت محدودیت‌های بانکی، سقف واریزی و دلایل دیگر با تأخیر زمانی انجام شود، کاربر نمی‌تواند غیر از ادعای عدم دریافت ریال از سوی تبدیل، هیچ‌گونه ادعا و یا درخواست دیگری از قبیل لغوکردن تراکنش و یا درخواست مبلغ بیشتری نماید.",
        },
        {
          title:
            "اگر تحت شرایطی تبدیل، اشتباهاً وجوه یا ارزی را به حساب کاربر منظور کند یا در محاسبات خود هر نوع اشتباهی نماید، هر زمان مجاز است مستقلاً و بدون انجام هیچ‌گونه تشریفات قضائی و دریافت اجازه‌ی کتبی از متعهد (صاحب حساب)، در رفع اشتباه و برداشت از حساب‌های وی، اقدام نماید و تشخیص تبدیل نسبت‌به وقوع اشتباه یا پرداخت بدون حق و لزوم برداشت از حساب، معتبر خواهدبود.",
        },
        {
          title:
            "تبدیل، هیچ تحلیل، پیش‌بینی و سیگنالی را تأیید نمی‌کند. تحلیل ارائه‌شده از بازار، صرفاً بر اساس پیش‌بینیِ انجام‌شده است و هیچ‌گونه قطعیتی بر وقوع آن وجود ندارد و تبدیل، هیچ تعهدی نسبت‌به انجام و به‌نتیجه‌رسیدن آن نخواهدداشت.",
        },
        {
          title:
            "از دریافت وجه و خرید ارز دیجیتال برای اشخاص دیگر تحت هر عنوانی، از جمله آگهی استخدام، کسب سود، کاریابی در منزل، و غیره، خودداری نماید و در غیر این صورت، چنانچه وجوهی از سوی دیگران برای خرید به حساب کاربر واریز شود، کاربر متوجه می‌باشد که ممکن است وجه واریزی سرقتی بوده و مسئولیت حقوقی و قضایی آن اعم از مجازات قانونی و جبران ضرر و زیان شاکی بر عهده کاربر خواهد بود و صرافی تبدیل هیچ گونه مسئولیتی در قبل این موضوع نخواهد داشت.",
        },
        {
          title:
            "نکات مهم در رابطه با خدمات معاملات تبدیل، شامل موارد ذیل می‌شود. کاربر باید از این موارد آگاه بوده و آن‌ها را رعایت کند:",
          list: [
            {
              title:
                "خدمات معامله‌ی تبدیل، نقش واسطه را میان کاربران برعهده دارد و ارزش و یا بازپرداخت پول مجازی را به هیچ وجه تضمین نمی‌کند و نیز مسئولیت منافع اقتصادی ناشی از معامله با واحد پول مجازی، برعهده‌ی کاربر خواهدبود. قیمت بازار پول مجازی که توسط تبدیل بعضاً اعلام می‌شود، ممکن است به‌طور موقت با قیمت واقعی هم‌خوان نباشد که علت آن، محدودیت‌های فنی از قبیل خطای سیستمی یا برنامه‌ای عدم تقارن محیطی، محدودیت در مورد فضای ارتباطی در داخل و خارج است. البته تبدیل، تمامی تلاش خود را برای رفع این تفاوت در قیمت انجام می‌دهد.",
            },
            {
              title:
                "تبدیل، صحت اطلاعات شخصی کاربر را که نزد خود دارد، تضمین نمی‌کند. به محض اطمینان از عدم صحت آن، تبدیل موظف به قطع استفاده‌ی کاربر مربوطه از خدمات معاملات تبدیل خواهدبود و اقدام متقابل را به انجام خواهدرساند.",
            },
            {
              title:
                "تبدیل در برابر خسارات ناشی از به‌سرقت‌رفتن حساب کاربر توسط شخص ثالث، مسئولیتی نخواهدداشت.",
            },
            {
              title:
                "حداقل حجم معاملات در تبدیل، ۱۰۰ هزار تومان است و کم‌تر از آن، معامله ثبت نمی‌شود.",
            },
            {
              title:
                "اولین درخواست برداشت تومان و رمزارز، ۴۸ ساعت بعد از اولین واریز ریالی امکان‌پذیر خواهدبود. بدیهی است این محدودیت، صرفاً برای اولین درخواست اعمال می‌شود و بعد از آن، محدودیتی به این شکل وجود نخواهدداشت.",
            },
            {
              title:
                "در صورت تعلیق حساب، تبدیل، تحقیقات اولیه در مورد حساب انجام می‌دهد و کاربر موظف خواهدبود که با تبدیل، همکاری کامل به عمل آورد.",
            },
            {
              title:
                "در صورت تعلیق حساب، کاربر نمی‌تواند ریال را سپرده‌گذاری کند یا درخواست واریز دهد و نمی‌تواند از کیف پول خود استفاده کند.",
            },
            {
              title:
                "کاربر، وجه ریالی را با توجه به میزان پول نقد در کیف پول ریال حساب خود دریافت خواهدکرد.",
            },
            {
              title:
                "کاربر همواره می‌تواند پول نقد معادل ریال خود را که در کیف پول حساب وی است، دریافت کند که مقدار آن، به تعیین آن از سوی تبدیل بستگی خواهدداشت؛ البته تبدیل، تعهدی به پرداخت سود مربوط به ریالِ موجود در کیف الکترونیکی ریال کاربر نخواهدداشت.",
            },
            {
              title:
                "تبدیل می‌تواند مبادله‌ی ریال را در شرایط ذیل ممنوع کند و البته ممنوعیت و علت آن را به کاربر اعلام خواهدکرد:",
              list: [
                "چنان‌چه درخواست کتبی از محاکم و نهادهای دولتی در این خصوص ارائه شود،",
                "در صورتی که مبلغ مبادله، بسیار زیاد باشد،",
                "در صورتی که کاربر، مرتکب جرم شده یا مظنون به تملک عواید از محل ارتکاب جرم باشد،",
                "در سایر موارد چنانچه محدود کردن استفاده از خدمات پرداخت بر اساس سیاست عملیاتی ما ضروری تشخیص داده شود.",
              ],
            },
            {
              title:
                "در حدود قانون، تبدیل هیچ‌گونه تعهد یا ضمانتی برای امورِ خاصِ مسکوت‌مانده در این موافقت‌نامه از حیث ارائه‌ی خدمات برعهده نمی‌گیرد. علاوه بر این، تبدیل در خصوص محصولات یا ارزش واحد پول مجازی که خود آن را صادر نکرده یا واگذار ننموده و هم‌چنین پرداخت آن را ضمانت ننموده‌است، هیچ‌گونه تعهدی نخواهدداشت.",
              list: [
                "در صورتی که خدمات، در اثر اقدام کاربر، دچار مشکل شود،",
                "خسارات ناشی از فرایند ورود به خدمات و استفاده از آن،",
                "خسارات ناشی از دسترسی غیرقانونی شخص ثالث به سرور و استفاده‌ی غیرقانونی از آن،",
                "ضررهای ناشی از انتقال و انتشار بدافزارها از سوی شخص ثالث،",
                "ضررهای ناشی از استفاده‌ی شخص ثالث از خدمات، خساراتی ناشی از دورزدن، حذف یا نابودی اطلاعات ارسال‌شده.",
                "ضررهای ناشی از قصور در خدمات ارتباطاتی توسط بستر ارائه‌ی خدمات. به‌ویژه مواردی که ارائه دهنده خدمات ارتباطاتی در صورت وجود رابطه حقوقی فی ما بین ما و کاربران موجب ناتوانی ما در ارائه‌ی خدمات شود و غیر قابل کنترل باشد. ضررهای ناشی از موارد قهریه از قبیل جنگ، آتش سوزی، زلزله و سایر بلایای طبیعی و موارد اضطراری ملی ضررهای ناشی از ویژگی های خاص پول مجازی. به ویژه مواردی که موجب نقص یا محدودیت فنی در سیستم مدیریت. در ارائه‌ی خدمات از سوی ما می‌شود.",
                "در صورتی که سرورها برای ارائه‌ی خدمات قطع شوند یا از دسترس خارج شوند،",
                "سایر خساراتِ برآمده از دلایلی که ناشی از اعمال یا عمل تبدیل نباشد.",
              ],
            },
            {
              title:
                "چنان‌چه اطلاعات ارائه‌شده از سوی کاربر، با واقعیت هم‌خوانی نداشته‌باشد، تبدیل می‌تواند ارائه‌ی خدمات را متوقف کرده یا تمامی یا بخشی از این موافقت‌نامه را فسخ نماید. در صورتی که خسارتی متوجه تبدیل شود، تبدیل می‌تواند خسارت مذکور را از حساب کاربر، برداشت کند.",
            },
            {
              title:
                "در صورتی که کاربر، باعث خسارات ذیل این ماده، از تبدیل، مطالبه‌ی خسارت نماید، تبدیل می‌تواند از طریق پول مجازی در واحد ریال در کیف الکترونیکی کاربر که تعلق آن به کاربر، مورد تأیید است -ولو کاربر با آن موافق نباشد- منظور نماید.",
            },
            {
              title:
                "در صورت ورود خسارت به تبدیل که ناشی از فعالیت‌های غیرقانونی است، تبدیل می‌تواند حق مطالبه‌ی خسارت علیه کاربر را به موجب قانون استفاده کند. لذا لازم است کاربر، از خدمات در چارچوب قوانین و مقررات استفاده نماید.",
            },
            {
              title:
                "صرافی برای خود این حق را محفوظ می‌داند که در صورت اسکم تشخیص دادن یک پروژه به منظور جلوگیری از هر گونه ضرر و زیان احتمالی کاربران، این ارز را از بازار معاملاتی خود حذف نماید. در این صورت دارایی کاربران در داخل کیف پول تبدیل به امانت محفوظ است.",
            },
          ],
        },
      ],
    };
  },
};
</script>

<style scoped>
h1 {
  font-weight: bold;
  font-size: 1.125rem;
  line-height: 1.75rem;
}

h2 {
  font-weight: bold;
  font-size: 1rem;
  line-height: 1.5rem;
}

@media (min-width: 640px) {
  h1 {
    font-size: 1.25rem;
    line-height: 1.75rem;
  }

  h2 {
    font-size: 1.125rem;
    line-height: 1.75rem;
  }
}

ol {
  padding-right: 0.5rem !important;
  list-style-type: disc;
  counter-reset: li;
  margin-bottom: 1rem;
}

ul {
  padding-right: 1rem !important;
  list-style-type: disc;
  margin-bottom: 1rem;
}

ol > li {
  counter-increment: li;
  line-height: 1.56;
  padding-right: 1.5rem !important;
  margin-bottom: 1rem;
}

ul > li {
  counter-increment: li;
  line-height: 1.56;
  padding-right: 1.1rem !important;
  margin-bottom: 1rem;
}

ol > li > ul > li > ul {
  margin-top: 1rem;
}

ol > li::marker {
  color: #0bb3f0;
  content: counter(li);
}

ul > li::marker {
  color: #0bb3f0;
}

ol > li > ul > li::marker {
  color: #0bb3f0 !important;
  content: "-" !important;
}

ol > li > ul > li > ul > li::marker {
  color: #0bb3f0 !important;
  content: "-" !important;
}
</style>
