<template>
  <div class="p-8 flex items-center justify-center bg-zinc-100 text-black">
    <div
      class="card drop-shadow flex flex-col items-center gap-4 bg-white p-8 w-full lg:w-[1100px]"
    >
      <h1 class="text-primary text-4xl font-bold mb-6 sm:mb-10">
        داستان تبدیل
      </h1>
      <div class="max-w-[800px] space-y-4 text-gray-800">
        <p>
          تیم تبدیل برای تحقق یک رویا تشکیل شده است. رویای ساختن دنیایی که که در
          آن هر فردی بتواند فارغ از دغدغه‌های مالی، مشغولِ کاری باشد که واقعا به
          آن علاقه دارد و نگران حفظ و افزایش ارزش پس انداز خود نباشد. تبدیل برای
          پاسخگویی به یک پرسش همیشگی در خانواده، دوستان و اطرافیان ما به وجود
          آمد: «با پولمان چه کار کنیم؟ پولمان را در کدام بانک بگذاریم تا بیشتر
          سود کنیم؟ چه بخریم تا پولمان بی ارزش نشود؟» پرسشی که دغدغه روز بسیاری
          از افراد بود؛ بدون اینکه پاسخی قدرتمند برای آن وجود داشته باشد.
        </p>
        <p>
          متاسفانه علی رغم وجود ابزارهای متنوع، پیچیدگی و گاها دور از دسترس بودن
          راه‌حل‌های موجود باعث شده است که اغلب افراد نتوانند پاسخ مناسبی برای
          رفع نیاز خود پیدا کنند و از این رو به راه‌حل‌های سنتی روی آورند و یا
          صرفا با اضطراب، تماشاچی تحولات بازارهای مالی باشند و از فرصت‌های موجود
          بهره‌ نبرند.
        </p>
        <p>
          تیم تبدیل مجموعه‌ای از متخصصین با تجربه در حوزه‌ی مالی، سرمایه‌گذاری و
          تکنولوژی است که در تلاشند تا با ترکیب تکنولوژی و علم مالی،‌ ابرازهایی
          ساده، کارآمد و تخصصی در اختیار کاربران خود قرار دهند تا افراد، با هر
          سطح دانش و تجربه‌ای بتوانند دغدغه‌هایشان را در زمینه‌ی سرمایه‌گذاری و
          حفظ و افزایش ارزش پس انداز خود رفع کنند.
        </p>
        <p>
          تحول یک صنعت کار ساده‌ای نیست؛ اما قول‌مان این است که همیشه در حال رشد
          و یادگیری خواهیم بود و پای رفع تمامی نیازها و دغدغه‌های مالی خانواده
          تبدیل ایستاده‌ایم.
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "about-us",
};
</script>

<style scoped></style>
