<template>
  <div class="text-gray-800">
    <LightBanner
      title="قوانین و مقررات"
      description="قوانین و شرایط استفاده از خدمات ارز دیجیتال تبدیل"
    />
    <section
      class="flex flex-col py-12 px-4 sm:px-8 items-center gap-12 bg-white text-xs sm:text-base"
    >
      <div class="w-full lg:w-4/5 xl:w-[800px] space-y-12">
        <p>
          موضوع موافقت‌نامه‌ی حاضر، اصول اولیه از قبیل حقوق، تکالیف و مسئولیت‌ها
          و نیز دستورالعمل‌های لازم جهت استفاده‌ی کاربر، از خدمات سایت تبدیل است
          که پلتفرم یا بستری برای معامله‌ی ارزهای دیجیتال می‌باشد. استفاده از هر
          یک از امکانات و خدمات سایت (ثبت‌نام، خرید، فروش و هرگونه امکانات دیگر)
          به این معنی است که کاربر، مفاد این توافق‌نامه را کاملاً خوانده، فهمیده
          و پذیرفته‌است. در غیر این‌صورت، حق استفاده از امکانات و خدمات سایت را
          ندارد.
        </p>

        <!-- definitions -->
        <div class="space-y-4">
          <h1>تعاریف و واژگان</h1>
          <div v-for="definition in definitions" class="space-y-4">
            <h2>
              {{ definition.title }}
            </h2>
            <p>{{ definition.description }}</p>
          </div>
        </div>

        <!-- sign-up process -->
        <div class="space-y-10">
          <div class="space-y-4 -mb-4">
            <h1>فرایند ثبت‌نام، احراز هویت و تأیید حساب کاربری</h1>
            <p>
              به‌منظور پیروی از قوانین ضدّپول‌شویی، ایجاد محیطی امن و جلوگیری از
              سوءاستفاده‌ی سارقینِ کارت‌های بانکی و مدارک جعلی، لازم است تمام
              کاربران نسبت‌به تأیید هویت خود اقدام کنند. گام‌های ثبت‌نام و احراز
              هویت به شرح زیر است:
            </p>
          </div>

          <div v-for="item in signUpProcess" class="flex gap-8">
            <img :src="item.iconPath" class="w-20 lg:-mr-28" />
            <div class="space-y-2 sm:space-y-4">
              <h2>{{ item.title }}</h2>
              <p>{{ item.description }}</p>
            </div>
          </div>

          <div class="p-4 bg-sky-100 rounded flex gap-4">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 24 24"
              class="w-16 fill-sky-400"
            >
              <path :d="mdiInformationOutline"></path>
            </svg>
            این اقدامات، حریم شخصی وی را نقض نخواهدکرد و مگر با حکم قضایی یا
            درخواست کتبی پلیس فتا، به هیچ شخص ثالثی ارائه نخواهدشد. تصمیم
            راجع‌به موفق یا ناموفق‌بودن احراز هویت، فقط و فقط در اختیار تبدیل
            خواهدبود و سایت تبدیل می‌تواند یک احراز هویت را به تشخیص خود قبول
            کند یا قبول نکند.
          </div>
        </div>

        <!-- ban account list -->
        <div class="space-y-4">
          <h1>
            در موارد ذیل، تبدیل می‌تواند ایجاد حساب را مردود اعلام کرده و
            نسبت‌به حذف حساب اقدام نماید:
          </h1>
          <ol>
            <li v-for="item in banAccount">{{ item }}</li>
          </ol>
        </div>

        <!-- account management -->
        <div class="space-y-4">
          <h1>مدیریت حساب</h1>
          <ul>
            <li v-for="item in accountManagement">{{ item }}</li>
          </ul>
        </div>

        <!-- cost & commissions -->
        <div class="space-y-4">
          <h1>هزینه‌ها و کارمزدها</h1>
          <ul>
            <li>
              هزینه‌ی خدمات و کارمزد تراکنش‌های مالیِ انجام‌شده در تبدیل، مطابق
              با توضیحات ارائه‌شده در صفحه‌ی
              <NuxtLink
                to="/commissions/cryptofee"
                class="cursor-pointer text-primary"
                >کارمزدها و هزینه‌ی خدمات
              </NuxtLink>
              است.
            </li>
            <li>
              هرگونه کارمزد (کمیسیون) و هزینه‌ی دیگر که سیستم بانکی و شبکه‌ی
              رمزارزها جهت نقل‌وانتقال پول به کاربر اضافه نماید، برعهده‌ی کاربر
              خواهدبود.
            </li>
          </ul>
        </div>

        <!-- user agreement -->
        <div class="space-y-4">
          <h1>کاربر می‌پذیرد که:</h1>
          <ol>
            <li v-for="item in userAgreement">
              {{ item.title }}
              <ul v-if="item.list">
                <li v-for="it in item.list">
                  {{ it.title }}
                  <ul v-if="it.list">
                    <li v-for="i in it.list">{{ i }}</li>
                  </ul>
                </li>
              </ul>
            </li>
          </ol>
        </div>

        <!-- resolve problem -->
        <div class="space-y-4">
          <h1>حل اختلاف</h1>
          <p>
            این موافقت‌نامه یا خدمات بر اساس قوانین جمهوری اسلامی ایران، قطع‌نظر
            از تابعیت یا محل سکونت کاربر تفسیر شده و تابع آن خواهدبود. قانون
            حاکم به حل و فصل اختلافات تابع قوانین ایران است. البته در صورتی که
            قانون مشخص یا رأی دادگاه در پیرامون پول مجازی و غیره وجود
            نداشته‌باشد، رویه یا باور قویِ خارج از این کشور می‌تواند در چارچوب
            قوانین و مقررات راجع‌به اختلاف ذیل این موافقت‌نامه یا خدمات، موجد
            اثر گردد. با بروز اختلاف فی‌مابین تبدیل و کاربر در خصوص استفاده از
            خدمات، تلاش تبدیل بر این است که این اختلاف، مرتفع گردد؛ در صورت
            ادامه‌ی اختلاف، امکان طرح دعوی از طریق ارجاع به داوری، ذیل قانون
            آیین دادرسی مدنی وجود خواهدداشت.
          </p>
        </div>

        <!-- app -->
        <div class="space-y-4">
          <h1>اپلیکیشن</h1>
          <p>
            <NuxtLink to="" class="cursor-pointer text-primary"
              >اپلیکیشن صرافی ارز دیجیتال
            </NuxtLink>
            تبدیل جهت بهبود تجربه کاربری دسترسی‌های زیر را در موقع لزوم از شما
            درخواست می‌نماید:
          </p>
          <ul>
            <li>
              دسترسی به خواندن پیامک: جهت پر کردن اتوماتیک کد تایید پیامکی (SMS)
            </li>
          </ul>
          <p>
            محتوای پیامک‌های شما محفوظ هستند و صرافی ارز دیجیتال تبدیل هیچ
            اطلاعاتی از سایر پیامک‌های شما را مشاهده یا ذخیره نمی‌نماید و از
            اطلاعاتی جز پیامک‌های کد تایید دریافتی از صرافی ارز دیجیتال تبدیل،
            تحت هیچ شرایطی استفاده نمی‌نماید.
          </p>
        </div>
      </div>
    </section>
  </div>
</template>

<script>
import LightBanner from "@/components/general/LightBanner";
import { mdiInformationOutline } from "@mdi/js";

const userAgreement = require("~/UserAgreement.json");

export default {
  name: "termsconditions",
  data() {
    return {
      mdiInformationOutline,
      definitions: [
        {
          title: "تبدیل",
          description:
            "قوانین و شرایط استفاده، مربوط به وب‌سایت‌های www.tabdil.org ،www.tabdeal.org و www.tabdeal.ir است که در این موافقت‌نامه، به اختصار، تبدیل نامیده می‌شوند. تبدیل، تابع قوانین جمهوری اسلامی ایران بوده و بستری برای تبادل ارزهای دیجیتال با یک‌دیگر و ریال است. هیچ‌گونه تبادل ارزی اعم از خرید و فروش دلار یا سایر ارزهای کاغذی، در این بستر صورت نمی‌گیرد.",
        },
        {
          title: "کاربر",
          description:
            "کاربر کسی است که بنا به اراده‌ی خود، از سایت تبدیل بازدید می‌کند و بدون هیچ‌گونه اجبار، از خدمات این سایت استفاده می‌کند. مفاد موافقت‌نامه که از سوی تبدیل ارائه می‌شود، پس از موافقت کاربر و تأیید آن (با ثبت‌نام به‌عنوان کاربر)، مورد اجرا گذاشته می‌شود و هم‌چنین در صورت لزوم از سوی تبدیل، قوانین و مقررات قابل اصلاح خواهدبود و مسلماً اعمال هرگونه تغییر در این موافقت‌نامه، قبل از تاریخ اجرای آن، به اطلاع کاربر خواهد رسید.",
        },
        {
          title: "ارز دیجیتال",
          description:
            "منظور از ارز دیجیتال یا رمزارز یا کریپتوکارنسی،‌ هرگونه ارز دیجیتالی است که بر روی سایت تبدیل برای معامله وجود دارد و مورد پذیرش سایت تبدیل است.",
        },
      ],
      signUpProcess: [
        {
          iconPath: "/images/terms-and-conditions/email-verification.svg",
          title: "تأیید ایمیل:",
          description:
            "پس از ثبت‌نام در تبدیل، یک کد تأیید به آدرس ایمیل ثبت‌نامی شما ارسال می‌گردد. با واردکردن این کد در سایت، ثبت‌نام شما در سایت انجام خواهدشد. پس از این مرحله شما می‌توانید به حساب تبدیل خود واریز ریال یا ارز دیجیتال داشته‌باشید اما امکان برداشت وجود نخواهدداشت.",
        },
        {
          iconPath: "/images/terms-and-conditions/personal-data.svg",
          title: "ارسال اطلاعات شخصی:",
          description:
            "در این مرحله، کاربر، نام، نام خانوادگی، کد ملی، شماره تماس ثابت، شماره موبایل،‌ تاریخ تولد و آدرس خود را وارد می‌نماید (در واردنمودن شماره موبایل دقت نمایید، زیرا یکی از راه‌های ارتباطی ما با شما در هنگام بروز مشکل خواهدبود).",
        },
        {
          iconPath: "/images/terms-and-conditions/bank-data.svg",
          title: "ارسال اطلاعات بانکی:",
          description:
            "در این مرحله، کاربر، شماره کارت بانکی خود را به‌همراه شماره شبا وارد می‌نماید (دقت بفرمایید شماره کارت بانکی و شبا، می‌توانند متعلق به دو حساب بانکی متفاوت باشند اما هر دو حساب بانکی باید متعلق به فرد صاحب حساب کاربری باشند).",
        },
        {
          iconPath:
            "/images/terms-and-conditions/contact-info-verification.svg",
          title: "تأیید اطلاعات تماس:",
          description:
            "در این گام، در صورتی که کاربر، شماره موبایلی به نام خود وارد کند، نیازی به تماس تلفنی نخواهدبود. در غیر این‌صورت، جهت تأیید اطلاعات تماس، با شماره تلفن ثابت کاربر، تماس صوتی گرفته می‌شود.",
        },
        {
          iconPath: "/images/terms-and-conditions/image-verification.svg",
          title: "تأیید عکس:",
          description:
            "در این مرحله، به‌عنوان آخرین گام احراز هویت، کاربر عکسی از چهره‌ی خود، در حالی که یک مدرک هویتی عکس‌دار معتبر جدید را به‌همراه متن دست‌نوشته‌ی احراز هویت -که با خطی خوانا بر روی کاغذ نوشته شده‌است- در دست دارد، ارسال می‌نماید. در صورت تأیید، دسترسی واریز ریالی باز می‌شود و پس از اولین واریز ریالی توسط کاربر به تبدیل، برداشت ریال و ارز دیجیتال حساب کاربر، موقتاً به‌مدت ۴۸ ساعت بسته می‌شود و پس از طی این زمان، برداشت حساب کاربر، باز می‌شود (دقت فرمایید که این موضوع، فقط برای اولین واریز ریالی کاربر، صادق است).",
        },
      ],
      banAccount: [
        "چنان‌چه کاربر به سن قانونی (۱۸ سال کامل شمسی) نرسیده‌باشد یا از اهلیت قانونی کافی برخوردار نباشد،",
        "تلاش برای ایجاد حساب از طریق ارائه‌ی اطلاعات شخصی دیگران توسط کاربر از قبیل نام یا آدرس پست الکترونیکی،",
        "عدم واردکردن اطلاعات لازم و یا واردکردن اطلاعات نادرست در زمان ایجاد حساب از سوی کاربر،",
        "در صورت عدم رعایت سایر قوانین و مقررات از سوی کاربر یا انجام اقداماتی برخلاف استانداردهایی که توسط سایت تبدیل اعلام می‌گردد.",
      ],
      accountManagement: [
        "حساب کاربر تنها باید توسط خود کاربر مورد استفاده قرار گیرد. در صورت تغییر اطلاعات کاربر پس از ثبت‌نام، کاربر باید بلافاصله اطلاعات جدید را در اطلاعات حساب، به‌روز کرده و منتظر تأیید سایت تبدیل در اسرع وقت باشد.",
        "در خصوص خسارات ناشی از عدم اصلاح اطلاعات یا صدمه‌ی ناشی از استفاده‌ی غیرمجاز از حساب کاربر توسط شخص دیگری که رمز عبور کاربر را به سرقت برده‌است، سایت تبدیل، مسئولیتی نخواهدداشت.",
        "برای ارائه‌ی بهتر خدمات، ممکن است اعلامیه‌های مربوط به استفاده از خدمات، شامل انواع اطلاعات برای کاربر ارسال شود یا مستقیماً به ایمیل یا تلفن همراه کاربر ارسال گردد.",
        "در صورت وقوع خطای سیستمی در استفاده از خدمات از جمله برنامه‌ها، سایت تبدیل می‌تواند اطلاعات نادرستِ ناشی از خطا را حذف کرده و اطلاعات حقیقی را اعمال کند.",
        "ممکن است در صورت نقض مقررات از سوی کاربر، سایت تبدیل به‌طور موقت یا دائمی، مانع استفاده‌ی کاربر از خدمات شود.",
        "در صورتی که کاربر، اطلاعات ورود خود به سامانه را از دست دهد، برای بازگرداندن اطلاعات به او، اطلاعاتی که بنا به صلاح‌دید تبدیل است، گرفته خواهدشد و در صورت تأیید اطلاعات، به فرد دسترسی داده خواهد‌شد و در صورت احرازنشدن کامل هویت، دسترسی بازگردانده نخواهدشد.",
        "در صورت عدم ورود طولانی‌مدت کاربر جهت استفاده از خدمات معین، ممکن است سایت تبدیل جهت امکان استفاده از خدمات، از کاربر، اطلاعات دیگری مطالبه کند.",
      ],
      userAgreement,
    };
  },
  components: {
    LightBanner,
  },
};
</script>

<style scoped>
h1 {
  font-weight: bold;
  font-size: 1.125rem;
  line-height: 1.75rem;
}

h2 {
  font-weight: bold;
  font-size: 1rem;
  line-height: 1.5rem;
}

@media (min-width: 640px) {
  h1 {
    font-size: 1.25rem;
    line-height: 1.75rem;
  }

  h2 {
    font-size: 1.125rem;
    line-height: 1.75rem;
  }
}

ol {
  padding-right: 0.5rem !important;
  list-style-type: disc;
  counter-reset: li;
  margin-bottom: 1rem;
}

ul {
  padding-right: 1rem !important;
  list-style-type: disc;
  margin-bottom: 1rem;
}

ol > li {
  counter-increment: li;
  line-height: 1.56;
  padding-right: 1.5rem !important;
  margin-bottom: 1rem;
}

ul > li {
  counter-increment: li;
  line-height: 1.56;
  padding-right: 1.1rem !important;
  margin-bottom: 1rem;
}

ol > li > ul > li > ul {
  margin-top: 1rem;
}

ol > li::marker {
  color: #0bb3f0;
  content: counter(li);
}

ul > li::marker {
  color: #0bb3f0;
}

ol > li > ul > li::marker {
  color: #0bb3f0 !important;
  content: "-" !important;
}

ol > li > ul > li > ul > li::marker {
  color: #0bb3f0 !important;
  content: "-" !important;
}
</style>
